Управление_торговлей_демо_Telegram.TelegramBotManagement/src/InformationRegisters/УБТ_ОдноразовыеПаролиАвторизацииЧатовTelegram/УБТ_ОдноразовыеПаролиАвторизацииЧатовTelegram.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>УБТ_ОдноразовыеПаролиАвторизацииЧатовTelegram</name>
  <resources>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДействителенДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.УБТ_СценарииБотовTelegram</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Управление_торговлей_демо_Telegram.TelegramBotManagement/src/InformationRegisters/УБТ_ОдноразовыеПаролиАвторизацииЧатовTelegram/Forms/ОдноразовыйПароль/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Параметры.Свойство("Сценарий", Сценарий);

	ОбновитьОдноразовыйПарольНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключитьОбработчикОжидания("ОбновитьОдноразовыйПароль", 1);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СкопироватьПароль(Команда)

	СкопироватьПарольВБуферОбмена();

	ТекстСообщения = НСтр(
		"az = 'Parol mübadilə buferinə kopyalandı';en = 'The OTP has been copied to the clipboard';ru = 'Пароль скопирован в буфер обмена.'");
	ПоказатьОповещениеПользователя( , , ТекстСообщения, БиблиотекаКартинок.Успешно32);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьОдноразовыйПароль()

	ОбновитьОдноразовыйПарольНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОбновитьОдноразовыйПарольНаСервере()

	Если ЗначениеЗаполнено(ДействителенДо) И ТекущаяДатаСеанса() < ДействителенДо Тогда
		Возврат;
	КонецЕсли;

	ДанныеПароля = РегистрыСведений.УБТ_ОдноразовыеПаролиАвторизацииЧатовTelegram.ОдноразовыйПарольАвторизацииЧата(
		Сценарий);

	Пароль = ДанныеПароля.Пароль;
	ДействителенДо = ДанныеПароля.ДействителенДо;

КонецПроцедуры

&НаКлиенте
Процедура СкопироватьПарольВБуферОбмена()

	HTMLДокумент = Элементы.БуферОбмена.document;
	ВременноеПолеВвода = HTMLДокумент.createElement("INPUT");
	АктивныйЭлемент = HTMLДокумент.activeElement;
	ВременноеПолеВвода.value = Пароль;
	HTMLДокумент.body.appendChild(ВременноеПолеВвода);
	ВременноеПолеВвода.select();
	HTMLДокумент.execCommand("copy");
	HTMLДокумент.body.removeChild(ВременноеПолеВвода);
	АктивныйЭлемент.focus();

КонецПроцедуры

#КонецОбласти
